{"start": [{"image":"neighborhood.png", "event":"dialogue", "text":"You stand outside the public square waiting for your date to arrive."},
{"event":"dialogue", "text":"You’re so nervous your palms are sweating."},
{"event":"dialogue", "text":"You look at your phone to check the time."},
{"event":"dialogue", "text":"She is ten minutes late. Should you call? Send a text? Are they bailing??"},
{"event":"dialogue", "text":"Just as you've made up your mind to suggest a reschedule, you hear someone call your name."},
{"event":"dialogue", "speaker":"date", "text":"'Hi, [Your Name]!'"},
{"event":"dialogue", "text":"You look up and your jaw drops."},
{"event":"dialogue", "show":"date1", "text":"Your date is even more gorgeous than their dating profile pictures."},
{"event":"dialogue", "show":"date1", "text":"They’re dressed in the most fashionable brands from head-to-toe."},
{"event":"dialogue", "show":"date1", "text":"You gulp."},
{"event":"dialogue", "show":"date1", "text":"They’re definitely out of your league. Wayyy out of your league."},
{"event":"dialogue", "show":"date1", "text":"You take a deep breath and square your shoulders."},
{"event":"dialogue", "show":"date1", "text":"Alright, you’re going to have to get through this date without revealing how much of a broke loser you are."},
{"event":"dialogue", "show":"date1", "text":"You can do this, just act natural!"},
{"event":"dialogue", "show":"date1", "text":"But before you can open your mouth to speak, your date starts talking."}, 
{"event":"dialogue", "speaker":"date", "show":"date", "text":"I’m so excited to hang out with you today! I had an idea of what we could do. I’ve been dying to go to these stables on the edge of town, they offer dressage lessons on some of the most well-bred horses in town. What do you think?"},
{"event":"dialogue", "show":"date", "text":"They look at you eagerly. Clearly they really want to do this. But this sounds expensive, and you can feel the (non)weight of your empty wallet in your pocket. You’d planned to just hang out at the park. It’s much cheaper, but you don’t want to disappoint them..."},
{"event":"option", "text":[["That sounds great, let’s go!", "2A"], ["I was actually thinking we could walk around the park nearby.", "1A"]]}],
"1A": [{"event":"dialogue", "speaker":"date", "show":"date1", "text":"'Oh...' your date responds, they sound a little deflated. 'Sure, I guess...'"},
{"event":"dialogue", "show":"date1", "text":"You try to keep yourself from dying inside as you watch their smile fall."},
{"event":"option", "text":[["'Alright, let’s head to the park!'", "1B"], ["'On second thought, let’s go to the stables!'", "2A"]]}],
"1B": [{"image":"park_alt.png", "event":"dialogue", "show":"date1", "text":"You walk over to the park and stroll around the playground. It is a nice day, and there are lots of children playing on the swings."},
{"event":"dialogue", "show":"date1", "text":"The two of you make small talk for a while, but you quickly realize that the two of you don't share many interests."},
{"event":"dialogue", "show":"date1", "text":"Eventually, you can tell that your date has lost interest as the conversation lulls into silence."},
{"event":"dialogue", "show":"date1", "text":"This isn't good. You were looking forward to this day, you can't just let your efforts go to waste."},
{"event":"dialogue", "show":"date1", "text":"You know you need to starting winning her back – and quick!"},
{"image":"carousel.png", "event":"dialogue", "text":"Looking around, you spot a carousel. It seems like your date is glancing at it too. Maybe a carnival ride could boost the spirits?"},
{"event":"dialogue", "text":"But it looks like the ride costs money... and your rent is due this week. Maybe a silly joke could sufficiently lighten the mood?"},
{"event":"option", "text":[["Suggest riding the carousel","1C"], ["Tell a silly joke", "1D"]]}],
"1D": [{"event":"dialogue", "show":"date", "text":"You turn to your date: “Hey! ...Why did the tomato turn red?” They look at you with confusion."}],
"2A": [{"image":"stables.png", "event":"dialogue", "audio":"up", "text":"You arrive at the stables."},
{"event":"dialogue", "show":"date1", "text":"The air is thick and stuffy. You can tell that everyone here is incredibly wealthy, dressed like they've gone horseback riding in the alps since before they learned to walk."},
{"event":"dialogue", "show":"date1", "text":"Suddenly, you feel self conscious in your hoodie and ripped jeans. You take a deep breath and try your best to blend in."},
{"event":"dialogue", "show":"date1", "text":"An attendant greets you at the door and leads you both into the barn. Her gaze is so sharp you feel your knees go weak just looking at her."},
{"event":"dialogue", "show":"date1","text":"'Here we have the horses available for you to ride today. This is our finest thoroughbred here –' She points to a massive horse with a shiny black coat. 'But for those on more of a budget,' you see the attendant eyeball you suspiciously as she says this 'we have our mules here.'"},
{"event":"dialogue", "show":"date1", "text":"She points to the stall across the way. The poor mule blinks slowly at you, looking somewhat pathetic."},
{"event":"dialogue", "speaker":"date", "show":"date", "text":"Your date turns to you – 'Ooooh I’ve always wanted to try the thoroughbred!' She smiles brightly. 'I heard he's the sweetest horse. And isn't he just so handsome!'"},
{"event":"dialogue", "show":"date1", "text":"The attendant glares impatiently, waiting for your choice."},
{"event":"option", "text":[["Yes, the thoroughbred of course!", "2C"], ["I’ll take the mule, I like his gritty look.", "2B"]]}]}